tool_vof/example/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);
nu              nu  [ 0 2 -1 0 0 0 0 ] 0.01;
alpha        alpha  [ 0 2 -1 0 0 0 0 ] 0.001;
rho            rho [ 1 -3 0 0 0 0 0 ] 1.0;

water
{
    transportModel  Newtonian;
    nu              0.001;
    rho             1000;
}

air
{
    transportModel  Newtonian;
    nu              1e-05;
    rho             1;
}

sigma            50;

// ************************************************************************* //
